console.log(5 > 3 && 5 === "5" && 0);
//логічний оператор && (і) він запинаеться на не правді і вертае значення на я кому запнувся;якщо всі умови будуть тру то вернеться остане значення (оперант)

console.log(5 && 2 && 3 && " " && 1)

//логічний оператор || ("або") шукае першу правду і запинаеться на ній , яшо всі умови фолс вертаеться остане значення 

console.log( 1 || 10 || 5 || 4 || 8 )

//логічне НЕ ! (оператор) робить інверсію міняе тру на фолс а фолс на тру 

console.log(!5)
console.log(!0)

console.log(!5 || !0 || 3 || 2)

// Напиши скрипт який провіряє можливість відкрити чат з користувачем.
//   Для цього користувач має бути:
//   - другом
//   - онлайн


const isOnline = false;

const isFriend = true;

const canOpenChat = isOnline && isFriend;
